dmlv91/bare-metal-stm32/projects/gpio_plus_interfaces/main.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include "stm32f091xc.h"
#include "stm32f0xx_ll_system.h"
#include "stm32f0xx_ll_bus.h"
#include "stm32f0xx_ll_gpio.h"
#include "stm32f0xx_ll_utils.h"
#include "stm32f0xx_ll_usart.h"
#include "stm32f0xx_ll_i2c.h"
#include "stm32f0xx_ll_rcc.h"

const uint8_t sensorAddress = 0x77;
uint8_t received_data;
char buffer[100];
uint32_t    init_clk_reg = 0, 
            init_clk_conf_reg = 0, 
            init_clk_conf_reg2 = 0, 
            init_clk_conf_reg3 = 0,
            cfgr_after_configDomain = 0,
            init_i2c_timingr = 0,
            init_i2c_cr1 = 0,
            init_i2c_cr2 = 0,
            init_i2c_oar1 = 0,
            init_i2c_isr = 0,
            i2c_timingr = 0,
            i2c_cr1 = 0,
            i2c_cr2 = 0,
            i2c_oar1 = 0,
            i2c_icr = 0,
            i2c_pecr = 0,
            i2c_rxdr = 0,
            i2c_txdr = 0,
            i2c_isr = 0;

uint8_t hum_oversampling = 0x01;
uint8_t temp_n_pres_oversampling = (0x5 << 2) | (0x2 << 5);
uint8_t gas_heat_duration = 0x59;
uint8_t nb_conv = 0x0;
uint8_t run_gas_1 = 0x01;
uint8_t ctrl_hum = 0x72;
uint8_t ctrl_meas = 0x74;
uint8_t gas_wait_0 = 0x64;
uint8_t res_heat_0 = 0x5A;
uint8_t ctrl_gas_1 = 0x71;
int heaterTargetTemp = 300;
uint8_t dbg;

typedef enum {
    INTERFACE_I2C_INIT,
    INTERFACE_I2C,
    INTERFACE_CLOCK_INIT,
    INTERFACE_CLOCK,
} InterfaceType;

void debugRegisters(InterfaceType interface);

void SystemClock_Config(void)
{
    init_clk_reg = RCC->CR;
    init_clk_conf_reg = RCC->CFGR;
    init_clk_conf_reg2 = RCC->CFGR2;
    init_clk_conf_reg3 = RCC->CFGR3;
    LL_RCC_PLL_Disable();
    LL_FLASH_SetLatency(LL_FLASH_LATENCY_1);
    // while(LL_RCC_PLL_IsReady() != 1);

    LL_RCC_HSI_Enable();
    while(LL_RCC_HSI_IsReady() != 1)
    {
    };

    LL_RCC_PLL_ConfigDomain_SYS(LL_RCC_PLLSOURCE_HSI, LL_RCC_PREDIV_DIV_2, LL_RCC_PLL_MUL_12);

    cfgr_after_configDomain = RCC -> CFGR;

    //set PLLXTPRE bit to 1 as the ConfigDomain_SYS function apparently does not.
    RCC->CFGR |= (1 << 17);
    RCC->CFGR |= (10 << 18);

    LL_RCC_PLL_Enable();
    while(LL_RCC_PLL_IsReady() != 1);


    LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_PLL);

    while(LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_PLL);

    LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_1);
    LL_RCC_SetAHBPrescaler(LL_RCC_SYSCLK_DIV_1);


    SystemCoreClockUpdate();
    LL_InitTick(SystemCoreClock, 1000U);
}


void _init(void) {}

void setGPIO(GPIO_TypeDef *GPIOx, uint32_t Pin, uint32_t Mode, uint32_t Type, uint32_t Speed, uint32_t Pull, uint32_t AltFunc) {
    LL_GPIO_SetPinMode(GPIOx, Pin, Mode);
    if (Mode != LL_GPIO_MODE_INPUT) {
        LL_GPIO_SetPinOutputType(GPIOx, Pin, Type);
    }
    if (Mode == LL_GPIO_MODE_ALTERNATE) {
        LL_GPIO_SetAFPin_8_15(GPIOx,Pin,AltFunc);
    }
    LL_GPIO_SetPinSpeed(GPIOx, Pin, Speed);
    LL_GPIO_SetPinPull(GPIOx, Pin, Pull);
}

void USART_config(void) {
    LL_USART_SetTransferDirection(USART1, LL_USART_DIRECTION_TX_RX);
    LL_USART_ConfigCharacter(USART1, LL_USART_DATAWIDTH_8B, LL_USART_PARITY_NONE, LL_USART_STOPBITS_1);
    LL_USART_SetBaudRate(USART1,SystemCoreClock,LL_USART_OVERSAMPLING_16, 115200);
    LL_RCC_SetUSARTClockSource(LL_RCC_USART1_CLKSOURCE_SYSCLK);
    LL_USART_Enable(USART1);

    while ((!(LL_USART_IsActiveFlag_TEACK(USART1))) || !(LL_USART_IsActiveFlag_REACK(USART1)));
}

void I2C_config(void) {
    LL_I2C_Disable(I2C1);
    LL_RCC_SetI2CClockSource(LL_RCC_I2C1_CLKSOURCE_SYSCLK);
    LL_I2C_SetMasterAddressingMode(I2C1, LL_I2C_ADDRESSING_MODE_7BIT);
    LL_I2C_SetMode(I2C1,LL_I2C_MODE_I2C);
    LL_I2C_SetOwnAddress1(I2C1, 0x3a, LL_I2C_OWNADDRESS1_7BIT);
    //Set up the I2C_TIMINGR value based on the reference manual 
    uint32_t timing_val = 0x13 | (0xF << 8) | (0x2 << 16) | (0x4 << 20) | (0xB << 28);
    LL_I2C_SetTiming(I2C1, timing_val);
    LL_I2C_EnableOwnAddress1(I2C1);
    LL_I2C_Enable(I2C1);

    while (!LL_I2C_IsEnabled(I2C1));

    debugRegisters(INTERFACE_I2C);
   
}

void USART_Transmit(const char *data, uint32_t size) {
    for (uint32_t i = 0; i < size; i++) {
        while (!LL_USART_IsActiveFlag_TXE(USART1));
        LL_USART_TransmitData8(USART1,data[i]);
        
    };
    while(!LL_USART_IsActiveFlag_TC(USART1));
}

unsigned char USART_Receive(void) {
    while(!LL_USART_IsActiveFlag_RXNE(USART1));
    return LL_USART_ReceiveData8(USART1);
}

void I2C_WriteRegister(uint8_t sensorAddress, uint8_t regAddress, uint8_t data) {
    sprintf(buffer, "Writing data (0x%02x)to register: 0x%02X \r\n", data, regAddress);
    USART_Transmit((const char *)buffer, strlen((char*)buffer));
    LL_I2C_HandleTransfer(I2C1, sensorAddress, LL_I2C_ADDRESSING_MODE_7BIT, 2, LL_I2C_MODE_AUTOEND, LL_I2C_GENERATE_START_WRITE);
    LL_I2C_TransmitData8(I2C1, regAddress);
    while (!LL_I2C_IsActiveFlag_TXE(I2C1));
   
    LL_I2C_TransmitData8(I2C1, data);
    while (!LL_I2C_IsActiveFlag_STOP(I2C1));
    LL_I2C_ClearFlag_STOP(I2C1);
}

uint8_t I2C_ReadRegister(uint8_t sensorAddress, uint8_t regAddress) {
    uint8_t data = 0;
    sprintf(buffer, "Reading data from register: 0x%02X \r\n", regAddress);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    LL_I2C_HandleTransfer(I2C1, sensorAddress << 1, LL_I2C_ADDRESSING_MODE_7BIT, 1, LL_I2C_MODE_SOFTEND, LL_I2C_GENERATE_START_WRITE);
    LL_I2C_TransmitData8(I2C1, regAddress);
    while (!LL_I2C_IsActiveFlag_TXE(I2C1));
    while (!LL_I2C_IsActiveFlag_TC(I2C1));

    LL_I2C_HandleTransfer(I2C1, sensorAddress << 1, LL_I2C_ADDRESSING_MODE_7BIT, 1, LL_I2C_MODE_AUTOEND, LL_I2C_GENERATE_START_READ);
    while (!LL_I2C_IsActiveFlag_RXNE(I2C1));
    data = LL_I2C_ReceiveData8(I2C1);

    while (!LL_I2C_IsActiveFlag_STOP(I2C1));
    LL_I2C_ClearFlag_STOP(I2C1);

    return data;
}

void scanBus(void) {
    int hasAddress = 0;
    sprintf((char*)buffer, "START I2C BUS SCAN!\r\n");
    USART_Transmit(buffer, strlen((char*)buffer));
    for (uint8_t address = 0; address < 128; address++) {
        // sprintf((char*)buffer, "Address 0x%02X\r\n", address);
        // USART_Transmit(buffer, strlen((char*)buffer));
        if (hasAddress == 0) {
            LL_I2C_HandleTransfer(I2C1, (address << 1), LL_I2C_ADDRESSING_MODE_7BIT, 0, LL_I2C_MODE_AUTOEND, LL_I2C_GENERATE_START_WRITE);
            if (address == 0x77) {

                USART_Transmit((const char*)"-----------------------------------------------\r\n",50);
                
                debugRegisters(INTERFACE_I2C);
            }
            // Wait for the acknowledge response
            while (!LL_I2C_IsActiveFlag_STOP(I2C1)) {
                if (LL_I2C_IsActiveFlag_NACK(I2C1)) {
                    // No device at this address
                    LL_I2C_ClearFlag_NACK(I2C1);
                    break;
                }
                if (LL_I2C_IsActiveFlag_ADDR(I2C1)) {
                    // Device found at this address
                    sprintf((char*)buffer, "Device found at 0x%02X\n", address);
                    USART_Transmit((const char *)buffer, strlen((char*)buffer));
                    LL_I2C_ClearFlag_ADDR(I2C1);
                    hasAddress = 1;
                    break;
                }
            }
            LL_I2C_ClearFlag_STOP(I2C1); // Clear STOP flag for next address
            for (volatile int i = 0; i < 100000; i++);
        }
    }
    sprintf((char*)buffer, "SCAN COMPLETED!\r\n");
    USART_Transmit(buffer, strlen((char*)buffer));
}

void debugRegisters(InterfaceType interface) {

    USART_Transmit((const char*)"################################################### \r\n",50);
    sprintf(buffer, "Getting register states for interface: %d  \r\n", interface);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));

