dmlv91/bare-metal-stm32/projects/gpio_plus_interfaces/main.c
    switch (interface) {
        case INTERFACE_I2C:

            i2c_timingr = I2C1 -> TIMINGR;
            i2c_cr1 = I2C1 -> CR1;
            i2c_cr2 = I2C1 -> CR2;
            i2c_oar1 = I2C1 -> OAR1;
            i2c_isr = I2C1 -> ISR;
            i2c_icr = I2C1 -> ICR;
            i2c_pecr = I2C1 -> PECR;
            i2c_rxdr = I2C1 -> RXDR;
            i2c_txdr = I2C1 -> TXDR;

            sprintf(buffer, "I2C_TIMINGR: 0x%08lX \r\n", i2c_timingr);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "I2C_CR1: 0x%08lX \r\n", i2c_cr1);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "I2C_CR2: 0x%08lX \r\n", i2c_cr2);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "I2C_OAR1: 0x%08lX \r\n", i2c_oar1);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "I2C_ISR: 0x%08lX \r\n", i2c_isr);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "I2C_ICR: 0x%08lX \r\n", i2c_icr);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "I2C_PECR: 0x%08lX \r\n", i2c_pecr);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "I2C_RXDR: 0x%08lX \r\n", i2c_rxdr);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "I2C_TXDR: 0x%08lX \r\n", i2c_txdr);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            USART_Transmit((const char*)"-----------------------------------------------\r\n",50);

            for (volatile int i = 0; i < 100000; i++);
            break;

        case INTERFACE_I2C_INIT:
            sprintf(buffer, "INIT I2C_TIMINGR: 0x%08lX \r\n", init_i2c_timingr);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "INIT I2C_CR1: 0x%08lX \r\n", init_i2c_cr1);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "INIT I2C_CR2: 0x%08lX \r\n", init_i2c_cr2);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "INIT I2C_OAR1: 0x%08lX \r\n", init_i2c_oar1);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "INIT I2C_ISR: 0x%08lX \r\n", init_i2c_isr);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            USART_Transmit((const char*)"-----------------------------------------------\r\n",50);

            for (volatile int i = 0; i < 100000; i++);

            break;
        
        case INTERFACE_CLOCK:

            uint32_t clock_reg = RCC->CR;
            uint32_t clock_conf_reg = RCC->CFGR;
            uint32_t clock_conf_reg2 = RCC->CFGR2;
            uint32_t clock_conf_reg3 = RCC->CFGR3;

            sprintf(buffer, "Clock reg: 0x%08lX \r\n", clock_reg);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "Clock config reg: 0x%08lX \r\n", clock_conf_reg);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "Clock config reg2: 0x%08lX \r\n", clock_conf_reg2);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "Clock config reg3: 0x%08lX \r\n", clock_conf_reg3);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            USART_Transmit((const char*)"-----------------------------------------------\r\n",50);

            for (volatile int i = 0; i < 100000; i++);

            //##########################################################################################
            //############THE SECTION BELOW REPLICATES SystemCoreClockUpdate calculations.##############
            //##########################################################################################

            // SystemCoreClockUpdate();
            // uint32_t sys_clk = SystemCoreClock, sys_clk_man = 0;
            // uint32_t sys_clk_status = 0, sys_clk_pllmull = 0, sys_clk_pllsrc = 0, sys_clk_prediv = 0;
            
            // //HSI == 0x00000000U, HSE == 0x00000004U, PLL == 0x00000008U, HSI48 = 0x0000000CU;
            // sys_clk_status = LL_RCC_GetSysClkSource(); 

            // //RCC_CFGR_PLLMUL -> Maska -> (0xFUL << 18U)
            // sys_clk_pllmull = LL_RCC_PLL_GetMultiplicator();
            
            // //RCC_CFGR_PLLSRC -> Maska -> (0x3UL << 15U)
            // sys_clk_pllsrc = LL_RCC_PLL_GetMainSource();
            
            // //RCC_CFGR2_PREDIV -> Maska -> (0xFUL << 0U)
            // sys_clk_prediv = LL_RCC_PLL_GetPrediv() +1;
            // uint32_t modified_mull = (sys_clk_pllmull >> 18) + 2;

            // sys_clk_man = (HSI_VALUE/sys_clk_prediv) * modified_mull;
            
            // sprintf(buffer, "SYSCLK: %lu Hz\r\n", sys_clk);
            // USART_Transmit((const char*)buffer, strlen((char*)buffer));

            // sprintf(buffer, "SYSCLK SRC: %lu \r\n", sys_clk_status);
            // USART_Transmit((const char*)buffer, strlen((char*)buffer));

            // sprintf(buffer, "SYSCLK PLL MUL: %lu \r\n", sys_clk_pllmull);
            // USART_Transmit((const char*)buffer, strlen((char*)buffer));

            // sprintf(buffer, "SYSCLK PLL SRC: %lu \r\n", sys_clk_pllsrc);
            // USART_Transmit((const char*)buffer, strlen((char*)buffer));

            // sprintf(buffer, "SYSCLK PLL PREDIV: %lu \r\n", sys_clk_prediv);
            // USART_Transmit((const char*)buffer, strlen((char*)buffer));

            // sprintf(buffer, "MOD MULL: %lu \r\n", modified_mull);
            // USART_Transmit((const char*)buffer, strlen((char*)buffer));

            // sprintf(buffer, "MANUAL CLK: %lu \r\n", sys_clk_man);
            // USART_Transmit((const char*)buffer, strlen((char*)buffer));
            
