dmlv91/bare-metal-stm32/projects/gpio_plus_interfaces/main.c
            // USART_Transmit((const char*)"-----------------------------------------------\r\n",50);

            // for (volatile int i = 0; i < 100000; i++);
            break;
        
        case INTERFACE_CLOCK_INIT:

            sprintf(buffer, "Initial Clock reg: 0x%08lX \r\n", init_clk_reg);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "Initial Clock config reg: 0x%08lX \r\n", init_clk_conf_reg);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "Initial Clock config reg2: 0x%08lX \r\n", init_clk_conf_reg2);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            sprintf(buffer, "Initial Clock config reg3: 0x%08lX \r\n", init_clk_conf_reg3);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            USART_Transmit((const char*)"-----------------------------------------------\r\n",50);

            for (volatile int i = 0; i < 100000; i++);

            sprintf(buffer, "CFGR after configDomainSys fimcton: 0x%08lX \r\n", cfgr_after_configDomain);
            USART_Transmit((const char*)buffer, strlen((char*)buffer));

            USART_Transmit((const char*)"-----------------------------------------------\r\n",50);

            for (volatile int i = 0; i < 100000; i++);
            break;
        
        default:
            break;
    }
}

//res_heat value calculation corresponding to BME680 datasheet  
uint8_t calc_res_heat_val(uint16_t targetTemp, uint8_t sensorAddress) {
    int amb_temp = 25;
    float var1;
    float var2;
    float var3;
    float var4;
    float var5;
    uint8_t par_g1 = I2C_ReadRegister(sensorAddress, 0xED);
    sprintf(buffer, "PAR_G1: 0x%02X \r\n", par_g1);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));

    uint8_t par_g3 = I2C_ReadRegister(sensorAddress,0xEE);
    sprintf(buffer, "PAR_G3: 0x%02X \r\n", par_g3);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));

    uint8_t par_g2_msb = I2C_ReadRegister(sensorAddress,0xEC);
    sprintf(buffer, "PAR_G2_MSB: 0x%02X \r\n", par_g2_msb);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));

    uint8_t par_g2_lsb = I2C_ReadRegister(sensorAddress,0xEB);
    sprintf(buffer, "PAR_G2_LSB: 0x%02X \r\n", par_g2_lsb);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));

    uint8_t res_heat_range = I2C_ReadRegister(sensorAddress,(0x02<<4));
    sprintf(buffer, "RES_HEAT_RANGE: 0x%02X \r\n", res_heat_range);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    
    uint8_t res_heat_val = I2C_ReadRegister(sensorAddress,0x00);
    sprintf(buffer, "RES_HEAT_VAL: 0x%02X \r\n", res_heat_val);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    
    uint16_t par_g2 = (par_g2_msb << 8) | par_g2_lsb;
    var1 = ((double)par_g1/16.0f) + 49.0f;
    var2 = (((double)par_g2/32768.0f)*0.0005f) + 0.00235f;
    var3 = (double)par_g3/1024.0f;
    var4 = var1 * (1.0f + (var2*(double)targetTemp));
    var5 = var4 + (var3*(double)amb_temp);
    uint8_t res_heat = (uint8_t)(3.4f*((var5*(4.0f/(4.0f+(double)res_heat_range))*(1.0f/(1.0f+((double)res_heat_val*0.002f))))-25));

    sprintf(buffer, "CALCULATED_RES_HEAT: 0x%02X \r\n", res_heat);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    return res_heat;

}

void setForcedMode(uint8_t sensorAddress) {

    //Set humidity oversampling to 1x by writing 0x01 to 0x72
    sprintf(buffer, "Write 0x01 to 0x72.\r\n");
    USART_Transmit((const char*)buffer, strlen((char*)buffer));

    I2C_WriteRegister((sensorAddress << 1), ctrl_hum, hum_oversampling);
    while(!LL_I2C_IsActiveFlag_TXE && LL_I2C_IsActiveFlag_RXNE);

    //set temperature oversampling to 2x by writing 0x2 to 0x74 << 5 
    //and set pressure oversampling to 16x by writing 0x5 to 0x74 << 2
    sprintf(buffer, "Write (0x5 << 2) | (0x2 << 5) to 0x74.\r\n");
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    I2C_WriteRegister((sensorAddress << 1), ctrl_meas, temp_n_pres_oversampling);
    while(!LL_I2C_IsActiveFlag_TXE && LL_I2C_IsActiveFlag_RXNE);

    //set gas sensor hot plate temperature and heating duration.
    sprintf(buffer, "Write 0x59 to 0x64.\r\n");
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    I2C_WriteRegister((sensorAddress << 1), gas_wait_0,gas_heat_duration );
    while(!LL_I2C_IsActiveFlag_TXE && LL_I2C_IsActiveFlag_RXNE);

    //set heater set-point with target resistance
    sprintf(buffer, "Read registers and calculate res_heat value.\r\n");
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    I2C_WriteRegister((sensorAddress << 1), res_heat_0, calc_res_heat_val(heaterTargetTemp,sensorAddress));
    while(!LL_I2C_IsActiveFlag_TXE && LL_I2C_IsActiveFlag_RXNE);
    sprintf(buffer, "Write calculated res_heat to 0x5A.\r\n");
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    
    //set nb_conv value to confimr gas heater settings and set run_gas_1 to 1 to enable the heater
    sprintf(buffer, "Write (0x00 | (1 << 4)) to 0x71.\r\n");
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    I2C_WriteRegister((sensorAddress << 1), ctrl_gas_1,(nb_conv | (run_gas_1 << 4)));
    while(!LL_I2C_IsActiveFlag_TXE && LL_I2C_IsActiveFlag_RXNE);

    sprintf(buffer, "Read all control registers:\r\n");
    USART_Transmit((const char*)buffer, strlen((char*)buffer));


    dbg = I2C_ReadRegister(sensorAddress,ctrl_hum);
    sprintf(buffer, "ctrl_hum: 0x%02X \r\n", dbg);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    dbg = I2C_ReadRegister(sensorAddress,ctrl_meas);
    sprintf(buffer, "ctrl_meas: 0x%02X \r\n", dbg);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    dbg = I2C_ReadRegister(sensorAddress,gas_wait_0);
    sprintf(buffer, "gas_wait_0: 0x%02X \r\n", dbg);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    dbg = I2C_ReadRegister(sensorAddress,res_heat_0);
    sprintf(buffer, "res_heat_0: 0x%02X \r\n", dbg);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    dbg = I2C_ReadRegister(sensorAddress,ctrl_gas_1);
    sprintf(buffer, "ctrl_gas_1: 0x%02X \r\n", dbg);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));


