dmlv91/bare-metal-stm32/projects/gpio_plus_interfaces/main.c
}

float calcTemperature(uint32_t temp_adc) {
    float var1;
    float var2;
    float t_fine;
    float temp_comp;

    uint8_t par_t1_msb = I2C_ReadRegister(sensorAddress,0xEA);
    uint8_t par_t1_lsb = I2C_ReadRegister(sensorAddress,0xE9);
    uint8_t par_t2_msb = I2C_ReadRegister(sensorAddress,0x8B);
    uint8_t par_t2_lsb = I2C_ReadRegister(sensorAddress,0x8A);
    uint16_t par_t1 = par_t1_lsb | (par_t1_msb << 8);
    uint16_t par_t2 = par_t2_lsb | (par_t2_msb << 8);
    uint8_t par_t3 = I2C_ReadRegister(sensorAddress,0x8C);

    var1 = (((double)temp_adc/16384.0f) - ((double)par_t1/1024.0f))*(double)par_t2;
    var2 = ((((double)temp_adc/131072.0f)-((double)par_t1/8192.0f))
        *(((double)temp_adc/131072.0f)- ((double)par_t1/8192.0f)))
        *((double)par_t3*16.0f);
    t_fine = var1+var2;
    temp_comp = t_fine/5120.0;

    return temp_comp;
}

int calcIntTemperature(uint32_t temp_adc) {
    int var1;
    int var2;
    int var3;

    uint8_t par_t1_msb = I2C_ReadRegister(sensorAddress,0xEA);
    uint8_t par_t1_lsb = I2C_ReadRegister(sensorAddress,0xE9);
    uint8_t par_t2_msb = I2C_ReadRegister(sensorAddress,0x8B);
    uint8_t par_t2_lsb = I2C_ReadRegister(sensorAddress,0x8A);
    uint16_t par_t1 = par_t1_lsb | (par_t1_msb << 8);
    uint16_t par_t2 = par_t2_lsb | (par_t2_msb << 8);
    uint8_t par_t3 = I2C_ReadRegister(sensorAddress,0x8C);

    sprintf(buffer, "par_t1: 0x%02X \r\n", par_t1);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    sprintf(buffer, "par_t2: 0x%02X \r\n", par_t2);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    sprintf(buffer, "par_t3: 0x%02X \r\n", par_t3);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));

    var1 = ((int32_t)temp_adc >> 3) - ((int32_t)par_t1 << 1);
    var2 = (var1*(int32_t)par_t2) >> 11;
    var3 = ((((var1 >> 1)* (var1 >> 1))>>12)*((int32_t)par_t3 << 4)) >> 14;
    int t_fine = var2+var3;
    int temp_comp = ((t_fine*5)+128) >> 8;

    return temp_comp;

}

bool initSensor(uint8_t sensorAddress) {
    uint8_t BME_680_ID = 0xD0;
    received_data = I2C_ReadRegister(sensorAddress,BME_680_ID);
    // debugRegisters(INTERFACE_I2C);
    sprintf(buffer, "INIT SENSOR DEBUG 0xD0: 0x%02X \r\n", received_data);
    USART_Transmit((const char*)buffer, strlen((char*)buffer));
    if (received_data == 0x61) {
        return true;
    } else {
        return false;
    }

}

int main(void)
{
    
    // uint8_t typedef byte;
    SystemClock_Config();
    LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOA);
    LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOB);
    LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOC);
    LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_USART1);
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C1);

    init_i2c_timingr = I2C1 -> TIMINGR;
    init_i2c_cr1 = I2C1 -> CR1;
    init_i2c_cr2 = I2C1 -> CR2;
    init_i2c_oar1 = I2C1 -> OAR1;
    init_i2c_isr = I2C1 -> ISR;
    LL_RCC_ConfigMCO(LL_RCC_MCO1SOURCE_SYSCLK, LL_RCC_MCO1_DIV_1);
    USART_config();
    I2C_config();
    
    debugRegisters(INTERFACE_CLOCK);
 

    // Configure outputs
    setGPIO(GPIOA, LL_GPIO_PIN_5, LL_GPIO_MODE_OUTPUT, LL_GPIO_OUTPUT_PUSHPULL, LL_GPIO_SPEED_FREQ_LOW, LL_GPIO_PULL_NO,0);
    
    //UART
    setGPIO(GPIOA, LL_GPIO_PIN_9, LL_GPIO_MODE_ALTERNATE, LL_GPIO_OUTPUT_PUSHPULL, LL_GPIO_SPEED_FREQ_HIGH, LL_GPIO_PULL_NO, LL_GPIO_AF_1);
    setGPIO(GPIOA, LL_GPIO_PIN_10, LL_GPIO_MODE_ALTERNATE, 0,LL_GPIO_SPEED_FREQ_HIGH, LL_GPIO_PULL_NO,LL_GPIO_AF_1);
    
    //I2C
    setGPIO(GPIOB, LL_GPIO_PIN_9,LL_GPIO_MODE_ALTERNATE, LL_GPIO_OUTPUT_OPENDRAIN, LL_GPIO_SPEED_FREQ_HIGH,LL_GPIO_PULL_NO, LL_GPIO_AF_1); 
    setGPIO(GPIOB, LL_GPIO_PIN_8, LL_GPIO_MODE_ALTERNATE, 0, LL_GPIO_SPEED_FREQ_HIGH, LL_GPIO_PULL_NO, LL_GPIO_AF_1);
    
    //MCO clock debug pins
    setGPIO(GPIOA, LL_GPIO_PIN_8, LL_GPIO_MODE_ALTERNATE, LL_GPIO_OUTPUT_PUSHPULL, LL_GPIO_SPEED_FREQ_HIGH, LL_GPIO_PULL_NO, LL_GPIO_AF_0);
    
    //Configure inputs
    setGPIO(GPIOC, LL_GPIO_PIN_13, LL_GPIO_MODE_INPUT,0,LL_GPIO_SPEED_FREQ_LOW,LL_GPIO_PULL_NO,0);
    
    // scanBus();

    sprintf(buffer, "START SENSOR INIT \r\n");
    USART_Transmit((const char*)buffer, strlen((char*)buffer));

    if (initSensor(sensorAddress)) {

        sprintf(buffer, "SENSOR INIT COMPLETE. START FORCED MODE \r\n");
        USART_Transmit((const char*)buffer, strlen((char*)buffer));
        
        setForcedMode(sensorAddress);
    
        sprintf(buffer, "FORCED MODE COMPLETE. MAKE 1 MEASUREMENT.\r\n");
        USART_Transmit((const char*)buffer, strlen((char*)buffer));
    
        sprintf(buffer, "Write 0x01 to 0x74.\r\n");
        USART_Transmit((const char*)buffer, strlen((char*)buffer));
        //change measuring mode to enable one forced measurment cycle (Set only first bit).
        uint8_t ctrl_meas_val = I2C_ReadRegister(sensorAddress,ctrl_meas);
        I2C_WriteRegister((sensorAddress << 1), ctrl_meas, (ctrl_meas_val |= (1 << 0)));
        while(!LL_I2C_IsActiveFlag_TXE && LL_I2C_IsActiveFlag_RXNE);

        dbg = I2C_ReadRegister(sensorAddress,ctrl_meas);
        sprintf(buffer, "ctrl_meas--------->: 0x%02X \r\n", dbg);
        USART_Transmit((const char*)buffer, strlen((char*)buffer));

        sprintf(buffer, "MODE CHANGED. CHECK NEW DATA FLAG VALUE.\r\n");
        USART_Transmit((const char*)buffer, strlen((char*)buffer));

        uint8_t meas_status_0 = 0x1D;
        uint8_t newDataFlag = I2C_ReadRegister(sensorAddress, meas_status_0);
        //print only 7th bit. If new data exists, 0x8 will be returned, otherwise 0.
        sprintf(buffer, "New Data: 0x%02X \r\n", newDataFlag );
        USART_Transmit((const char*)buffer, strlen((char*)buffer));
    
        sprintf(buffer, "MODE CHANGED. READ TEMP VALUE.\r\n");
        USART_Transmit((const char*)buffer, strlen((char*)buffer));
    
        uint8_t temp_msb_add = 0x22;
        uint8_t temp_lsb_add = 0x23;
        uint8_t temp_xlsb_add = 0x24;
    
        uint8_t temp_msb = I2C_ReadRegister(sensorAddress, temp_msb_add);
        sprintf(buffer, "DEBUG temp_msb: 0x%02X \r\n", temp_msb);
        USART_Transmit((const char*)buffer, strlen((char*)buffer));
        
        uint8_t temp_lsb = I2C_ReadRegister(sensorAddress, temp_lsb_add);
        sprintf(buffer, "DEBUG temp_lsb: 0x%02X \r\n", temp_lsb);
        USART_Transmit((const char*)buffer, strlen((char*)buffer));
        
        uint8_t temp_xlsb = I2C_ReadRegister(sensorAddress, temp_xlsb_add);
        sprintf(buffer, "DEBUG temp_xlsb: 0x%02X \r\n", temp_xlsb);
        USART_Transmit((const char*)buffer, strlen((char*)buffer));
        
        uint32_t temperature = ((uint32_t)temp_msb << 12) | ((uint32_t)temp_lsb << 4) | (temp_xlsb >> 4);
        
        sprintf(buffer, "DEBUG temperature (full 20 bits): 0x%08lX \r\n", temperature);
        USART_Transmit((const char*)buffer, strlen((char*)buffer));
        
        //As the data resolution depends on osrs_t value (16bits + (osrs_t - 1)) 3 lower bits are discarded because osrs_t is set to 2. 
        temperature = temperature >> 3;
    
        sprintf(buffer, "DEBUG temperature: 0x%08lX \r\n", temperature);
        USART_Transmit((const char*)buffer, strlen((char*)buffer));

        int realTemp = calcIntTemperature(temperature);
        sprintf(buffer, "Real temperature:  %d\r\n", realTemp);
        USART_Transmit((const char*)buffer, strlen((char*)buffer));

        uint8_t config_val = I2C_ReadRegister(sensorAddress,0x75);
        sprintf(buffer, "DEBUG config: 0x%02X \r\n", config_val);
        USART_Transmit((const char*)buffer, strlen((char*)buffer));
        
    } else {
        sprintf(buffer, "Sensor initialization error. Check I2C data bus and sensor\r\n");
        USART_Transmit((const char*)buffer, strlen((char*)buffer));
    }
    


    // Main loop
    while (1)
    {
        
        LL_GPIO_TogglePin(GPIOA, LL_GPIO_PIN_5);

        // Simple delay
        for (volatile int i = 0; i < 1000000; i++);
    }

    return 0;
}
